export const ru = {
    global: {
        networkLost: 'нет сети',
        rightsReserved: 'все права защищены',
        next: 'далее',
        done: 'завершить',
        create: 'создать',
        edit: 'редактировать',
        follow: 'подписаться',
        invite: 'пригласить',
        info: 'информация',
        open: 'открыть',
        error: {
            item: 'ошибка | ошибки',
            count: 'нет ошибок | ошибка | ошибки | ошибок'
        },
        warning: 'осторожно',
        more: 'подробнее'
    },
    activity: {
        item: 'активность | активности',
        count: 'нет активностей | активность | активности | активностей',

        myProfile: 'мой профиль',
        newActivity: 'новые активности',
        seeAll: 'смотреть все',
        friendsOffline: 'друзья в приложении',
        seePeople: 'смотреть всех'
    },
    auth: {
        signIn: 'войти',
        signUp: 'регистрация',
        messages: {
            verifyAccount: 'ссылка для подтверждения аккаунта была' +
                ' отправлена на ваш адрес электронной почты',
            loginNotMatch: 'неверный логин или пароль',
            remindPassword: 'забыли пароль?'
        },
    },

    category: {
        item: 'категория | категории',
        count: 'нет категорий | категория | категории | категорий'
    },
    event: {
        item: 'событие | события',
        count: 'нет событий | событие | события | событий',
        author: {
            item: 'автор | авторы',
            count: 'нет автора | автор | автора | авторов'
        },
        lineUp: 'расписание',
        price: 'стоимость',
        terms: 'правила',
        people: 'участники',
        status: {
            active: 'сейчас активно',
            wait: 'скоро начнётся',
            end: 'завершилось сегодня'
        },
        messages: {
            category: 'это <span class="text-info">{category}</span>',
            time: 'следующий этап начнётся в <span class="text-info">{time}</span>',
            address: 'адрес: <span class="text-info">{address}</span>',
            experience: 'можно получить новый опыт',
            countMax: 'нет ограничений по количеству участников | не больше {count} человека | не больше {count} человек | не больше {count} человек',
            ageMax: 'нет ограничений по возрасту участников | старше {age} года | старше {age} лет | старше {age} лет'
        }
    },
    experience: {
        item: 'запись опыта | записи опыта',
        count: 'нет записей об опыте | запись опыта | записи опыта | записей опыта'
    },
    filter: {
        item: 'фильтр | фильтры',
        count: 'нет фильтров | фильтр | фильтра | фильтров',
        search: 'поиск',
        searchType: 'тип запроса',
        moreFilters: 'все фильтры'
    },
    interest: {
        item: 'интерес | интересы',
        count: 'нет интересов | интерес | интереса | интересов'
    },
    notify: {
        item: 'уведомление | уведомления',
        count: 'нет уведомлений | уведомление | уведомления | уведомлений'
    },
    relations: {
        follower: {
            item: 'подписчик | подписчики',
            count: 'нет подписчиков | подписчик | подписчика | подписчиков'
        },
        member: {
            item: 'участник | участники',
            count: 'нет участников | участник | участника | участников'
        },
        invited: {
            item: 'приглашённый | приглашённые',
            count: 'нет приглашённых | приглашённый | приглашённых | приглашённых'
        },
        creator: {
            item: 'создатель | создатели',
            count: 'нет создателя | создатель | создателя | создателей'
        },
        following: {
            item: 'подписан | подписаны',
            count: 'нет подписчиков | подписан | подписаны | подписаны'
        },
        friend: {
            item: 'друг | друзья',
            count: 'нет друзей | друг | друга | друзей',
        }
    },
    story: {
        item: 'история | истории',
        count: 'нет историй | история | истории | историй'
    },
    user: {
        item: 'пользователь | пользователи',
        count: 'нет пользователей | пользователь | пользователя | пользователей',
        name: {
            item: 'имя | имена',
            count: 'нет имени | имя | имени | имён'
        },
        birthday: 'день рождения | дни рождения',
        appName: 'nickname',
        email: 'email',
        password: 'пароль | пароли',
    }
}

export default ru
